Revit 2027 API
FabricArea.MajorSheetAlignment Property
 The fabric sheet alignment in the fabric distribution in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricSheetAlignment MajorSheetAlignment { get; set; }
Public Property MajorSheetAlignment As FabricSheetAlignment
	Get
	Set
public:
property FabricSheetAlignment MajorSheetAlignment {
	FabricSheetAlignment get ();
	void set (FabricSheetAlignment value);
}
member MajorSheetAlignment : FabricSheetAlignment with get, set
Property Value
FabricSheetAlignment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Changing the value of this property causes change of MajorLapSplice and LapSplicePosition properties if needed
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace